Catalogs/ТНВЭДПоВидамПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТНВЭДПоВидамПродукцииИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодЧЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКлассификаторовВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаПоставляемыхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТНВЭДПоВидамПродукцииИС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ПриЗагрузкеКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления) Экспорт

	Блокировка = Новый БлокировкаДанных();
	Блокировка.Добавить(Метаданные.Справочники.ТНВЭДПоВидамПродукцииИС.ПолноеИмя());
	
	Попытка
		Блокировка.Заблокировать();
		ОбновитьКодыТНВЭДИзКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления);
		
	Исключение
		ТекстОшибкиПодробно = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		РезультатОбновления.СообщениеОбОшибке = ТекстОшибкиПодробно;
		РезультатОбновления.УспешнаяЗагрузка  = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьКодыТНВЭДИзКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления)
	
	Идентификаторы      = ПараметрыЗагрузки.Идентификаторы;
	ДанныеКЗагрузке     = ДанныеКлассификатора.КодыТНВЭД;
	ИмяТаблицыВидов     = Метаданные.Справочники.ВидыПродукцииИС.ПолноеИмя();
	КонфликтыОбновления = ПараметрыЗагрузки.КонфликтыОбновления;
	ИмяТаблицы          = Метаданные.Справочники.ТНВЭДПоВидамПродукцииИС.ПолноеИмя();
	
	ДанныеДляПодбора = Новый ТаблицаЗначений;
	ДанныеДляПодбора.Колонки.Добавить("Код",                        ОбщегоНазначения.ОписаниеТипаСтрока(10));
	ДанныеДляПодбора.Колонки.Добавить("Наименование",               ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ДанныеДляПодбора.Колонки.Добавить("Идентификатор",              ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ДанныеДляПодбора.Колонки.Добавить("Статус",                     ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ДанныеДляПодбора.Колонки.Добавить("ВидПродукцииИС",             Новый ОписаниеТипов("СправочникСсылка.ВидыПродукцииИС"));
	ДанныеДляПодбора.Колонки.Добавить("НаименованиеПолное",         ОбщегоНазначения.ОписаниеТипаСтрока(0));
	ДанныеДляПодбора.Колонки.Добавить("ХешСуммаПоставляемыхДанных", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ДанныеДляПодбора.Колонки.Добавить("КодЧЗ",                      ОбщегоНазначения.ОписаниеТипаСтрока(15));
	ДанныеДляПодбора.Колонки.Добавить("Модифицирован",              Новый ОписаниеТипов("Булево"));
	
	Для каждого СтрокаКЗагрузке из ДанныеКЗагрузке Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ИмяТаблицы",    ИмяТаблицыВидов);
		СтруктураПоиска.Вставить("Наименование",  СтрокаКЗагрузке.ВидПродукцииНаименование);
		СтруктураПоиска.Вставить("Идентификатор", СтрокаКЗагрузке.ВидПродукцииИдентификатор);
		
		НайденныеВидыПродукции = Идентификаторы.НайтиСтроки(СтруктураПоиска);
		Если НайденныеВидыПродукции.Количество() Тогда
			ВидПродукцииИС = НайденныеВидыПродукции[0].Ссылка;
		Иначе
			РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
			Продолжить;
		КонецЕсли;
		
		СтрокаДляПодбора = ДанныеДляПодбора.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДляПодбора, СтрокаКЗагрузке);
		
		СтрокаДляПодбора.ВидПродукцииИС = ВидПродукцииИС;
		
		ЕстьСвойствоМодифицирован = СтрокаКЗагрузке.Свойство("Модифицирован");
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДляПодбора.Код КАК Код,
		|	ДанныеДляПодбора.Наименование КАК Наименование,
		|	ДанныеДляПодбора.НаименованиеПолное КАК НаименованиеПолное,
		|	ДанныеДляПодбора.Идентификатор КАК Идентификатор,
		|	ДанныеДляПодбора.КодЧЗ КАК КодЧЗ,
		|	ДанныеДляПодбора.Статус КАК Статус,
		|	ДанныеДляПодбора.ВидПродукцииИС КАК ВидПродукцииИС,
		|	ДанныеДляПодбора.ХешСуммаПоставляемыхДанных КАК ХешСуммаЗагружаемыхДанных,
		|	ДанныеДляПодбора.Модифицирован КАК Модифицирован
		|ПОМЕСТИТЬ втДанныеДляПодбора
		|ИЗ
		|	&ДанныеДляПодбора КАК ДанныеДляПодбора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДанныеДляПодбора.Код КАК Код,
		|	втДанныеДляПодбора.Идентификатор КАК Идентификатор,
		|	втДанныеДляПодбора.ВидПродукцииИС КАК ВидПродукцииИС,
		|	втДанныеДляПодбора.Модифицирован КАК Модифицирован,
		|	ТНВЭДПоВидамПродукцииИС.Ссылка КАК СсылкаПоИдентификатору,
		|	ТНВЭДПоВидамПродукцииИС.ХешСумма КАК ХешСумма,
		|	ТНВЭДПоВидамПродукцииИС.ХешСуммаПоставляемыхДанных КАК ХешСуммаПоставляемыхДанных
		|ПОМЕСТИТЬ втРезультатыПодбораПоИдентификатору
		|ИЗ
		|	втДанныеДляПодбора КАК втДанныеДляПодбора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТНВЭДПоВидамПродукцииИС КАК ТНВЭДПоВидамПродукцииИС
		|		ПО (ТНВЭДПоВидамПродукцииИС.Идентификатор = втДанныеДляПодбора.Идентификатор)
		|ГДЕ
		|	втДанныеДляПодбора.Идентификатор <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТНВЭДПоВидамПродукцииИС.Ссылка КАК СсылкаПоКлючевымПолям,
		|	втДанныеДляПодбора.Код КАК Код,
		|	втДанныеДляПодбора.Наименование КАК Наименование,
		|	втДанныеДляПодбора.КодЧЗ КАК КодЧЗ,
		|	втДанныеДляПодбора.НаименованиеПолное КАК НаименованиеПолное,
		|	втДанныеДляПодбора.Идентификатор КАК Идентификатор,
		|	втДанныеДляПодбора.Статус КАК Статус,
		|	втДанныеДляПодбора.ХешСуммаЗагружаемыхДанных КАК ХешСуммаЗагружаемыхДанных,
		|	ТНВЭДПоВидамПродукцииИС.ХешСумма КАК ХешСумма,
		|	ТНВЭДПоВидамПродукцииИС.ХешСуммаПоставляемыхДанных КАК ХешСуммаПоставляемыхДанных,
		|	втДанныеДляПодбора.ВидПродукцииИС КАК ВидПродукцииИС,
		|	втДанныеДляПодбора.Модифицирован КАК Модифицирован
		|ПОМЕСТИТЬ втРезультатыПодбораПоКлючевымПолям
		|ИЗ
		|	втДанныеДляПодбора КАК втДанныеДляПодбора
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТНВЭДПоВидамПродукцииИС КАК ТНВЭДПоВидамПродукцииИС
		|		ПО втДанныеДляПодбора.Код = ТНВЭДПоВидамПродукцииИС.Код
		|		И втДанныеДляПодбора.ВидПродукцииИС = ТНВЭДПоВидамПродукцииИС.ВидПродукции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРезультатыПодбораПоКлючевымПолям.Наименование КАК Наименование,
		|	втРезультатыПодбораПоКлючевымПолям.НаименованиеПолное КАК НаименованиеПолное,
		|	втРезультатыПодбораПоКлючевымПолям.Код КАК Код,
		|	втРезультатыПодбораПоКлючевымПолям.КодЧЗ КАК КодЧЗ,
		|	втРезультатыПодбораПоКлючевымПолям.Идентификатор КАК Идентификатор,
		|	втРезультатыПодбораПоКлючевымПолям.Статус КАК Статус,
		|	втРезультатыПодбораПоКлючевымПолям.ВидПродукцииИС КАК ВидПродукции,
		|	втРезультатыПодбораПоКлючевымПолям.ХешСуммаЗагружаемыхДанных,
		|	втРезультатыПодбораПоКлючевымПолям.Модифицирован,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(втРезультатыПодбораПоКлючевымПолям.СсылкаПоКлючевымПолям, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору
		|	КОНЕЦ КАК СуществующийОбъектСсылка,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА втРезультатыПодбораПоКлючевымПолям.ХешСумма
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.ХешСумма
		|	КОНЕЦ КАК ХешСумма,
		|	ВЫБОР
		|		КОГДА втРезультатыПодбораПоИдентификатору.СсылкаПоИдентификатору ЕСТЬ NULL
		|			ТОГДА втРезультатыПодбораПоКлючевымПолям.ХешСуммаПоставляемыхДанных
		|		ИНАЧЕ втРезультатыПодбораПоИдентификатору.ХешСуммаПоставляемыхДанных
		|	КОНЕЦ КАК ХешСуммаПоставляемыхДанных
		|ИЗ
		|	втРезультатыПодбораПоКлючевымПолям КАК втРезультатыПодбораПоКлючевымПолям
		|		ЛЕВОЕ СОЕДИНЕНИЕ втРезультатыПодбораПоИдентификатору КАК втРезультатыПодбораПоИдентификатору
		|		ПО втРезультатыПодбораПоКлючевымПолям.Идентификатор = втРезультатыПодбораПоИдентификатору.Идентификатор
		|		И втРезультатыПодбораПоКлючевымПолям.Код = втРезультатыПодбораПоИдентификатору.Код
		|		И втРезультатыПодбораПоКлючевымПолям.ВидПродукцииИС = втРезультатыПодбораПоИдентификатору.ВидПродукцииИС";
	Запрос.УстановитьПараметр("ДанныеДляПодбора", ДанныеДляПодбора);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаИдентификатора = Идентификаторы.Добавить();
		СтрокаИдентификатора.ИмяТаблицы    = ИмяТаблицы;
		СтрокаИдентификатора.Идентификатор = ВыборкаДетальныеЗаписи.Идентификатор;
		СтрокаИдентификатора.Код           = ВыборкаДетальныеЗаписи.Код;
		
		СоставКлюча = Новый СписокЗначений;
		СоставКлюча.Добавить(ВыборкаДетальныеЗаписи.Код);
		СоставКлюча.Добавить(ВыборкаДетальныеЗаписи.ВидПродукции);
		СоставКлюча.СортироватьПоЗначению();
		
		СтрокаИдентификатора.КлючЗначения = ОбщегоНазначенияИС.ХэшСуммаСтроки(СтрСоединить(СоставКлюча.ВыгрузитьЗначения()));
		
		Если ПараметрыЗагрузки.ЗагрузкаИзменений И ЕстьСвойствоМодифицирован Тогда
			Если Не ВыборкаДетальныеЗаписи.Модифицирован Тогда
				СтрокаИдентификатора.Ссылка = ВыборкаДетальныеЗаписи.СуществующийОбъектСсылка;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ДальнейшиеДействия = ОбщегоНазначенияИС.ПараметрыОбновленияЭлементовПриЗагрузкеКлассификатора(ПараметрыЗагрузки,
			ВыборкаДетальныеЗаписи.СуществующийОбъектСсылка, ВыборкаДетальныеЗаписи.ХешСумма,
			ВыборкаДетальныеЗаписи.ХешСуммаПоставляемыхДанных, ВыборкаДетальныеЗаписи.ХешСуммаЗагружаемыхДанных);
		
		Если ДальнейшиеДействия.КоллизияИзменений Тогда
			ТекстКоллизии = СтрШаблон(НСтр(
				"ru = 'Невозможно загрузить изменения. Элемент справочника ""%1"" с идентификатором ""%2"" был изменен ранее'"),
				Метаданные.Справочники.ТНВЭДПоВидамПродукцииИС.ПолноеИмя(), ВыборкаДетальныеЗаписи.Идентификатор);
			ВызватьИсключение ТекстКоллизии;
		КонецЕсли;
		
		Если ДальнейшиеДействия.СоздатьЭлемент Тогда
			СуществующийОбъект = СоздатьЭлемент();
		ИначеЕсли ДальнейшиеДействия.ТребуетсяОбновление Тогда
			СуществующийОбъект = ВыборкаДетальныеЗаписи.СуществующийОбъектСсылка.ПолучитьОбъект();
		Иначе
			СтрокаИдентификатора.Ссылка = ВыборкаДетальныеЗаписи.СуществующийОбъектСсылка;		
		КонецЕсли;
		
		Если ДальнейшиеДействия.ЗафиксироватьКонфликт Тогда
			СтруктураЗагружаемыхДанных  = ИнициализироватьПараметрыОбновления();

			ЗаполнитьЗначенияСвойств(СтруктураЗагружаемыхДанных, ВыборкаДетальныеЗаписи, , "ХешСуммаПоставляемыхДанных");

			СтруктураЗагружаемыхДанных.ХешСуммаПоставляемыхДанных = ВыборкаДетальныеЗаписи.ХешСуммаЗагружаемыхДанных;
			
			ВидПродукции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыборкаДетальныеЗаписи.ВидПродукции, 
				"Наименование, Идентификатор");
				
			СтруктураЗагружаемыхДанных.ВидПродукцииНаименование  = ВидПродукции.Наименование;
			СтруктураЗагружаемыхДанных.ВидПродукцииИдентификатор = ВидПродукции.Идентификатор;
			
			ОбщегоНазначенияИС.ДобавитьЭлементДляЗаписиКонфликтаПриОбновлении(
				КонфликтыОбновления, ВыборкаДетальныеЗаписи.СуществующийОбъектСсылка, СтруктураЗагружаемыхДанных);

		КонецЕсли;	
		
		Если ДальнейшиеДействия.ТребуетсяОбновление Или ДальнейшиеДействия.СоздатьЭлемент Тогда
			ЗаполнитьЗначенияСвойств(СуществующийОбъект, ВыборкаДетальныеЗаписи, , "Идентификатор,ХешСуммаПоставляемыхДанных");
            
			Если Не ЗначениеЗаполнено(СуществующийОбъект.Идентификатор) Тогда
				СуществующийОбъект.Идентификатор = ВыборкаДетальныеЗаписи.Идентификатор;
			КонецЕсли;

            Если Метаданные.Перечисления.СтатусыКлассификаторовВидовПродукцииИС.ЗначенияПеречисления.Найти(
				ВыборкаДетальныеЗаписи.Статус) <> Неопределено Тогда
				СуществующийОбъект.Статус = Перечисления.СтатусыКлассификаторовВидовПродукцииИС[ВыборкаДетальныеЗаписи.Статус];
            КонецЕсли;
            
			СуществующийОбъект.ХешСумма = ВыборкаДетальныеЗаписи.ХешСуммаЗагружаемыхДанных;
            
            Если Не ПараметрыЗагрузки.ЗагрузкаИзменений Тогда
            	СуществующийОбъект.ХешСуммаПоставляемыхДанных = ВыборкаДетальныеЗаписи.ХешСуммаЗагружаемыхДанных;
            КонецЕсли;
            			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СуществующийОбъект);
			
			СтрокаИдентификатора.Ссылка = СуществующийОбъект.Ссылка;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПараметрыЗагрузки.ЗагрузкаИзменений Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТНВЭДПоВидамПродукцииИС.Ссылка КАК Ссылка,
		|	ТНВЭДПоВидамПродукцииИС.Идентификатор КАК Идентификатор,
		|	ТНВЭДПоВидамПродукцииИС.Код КАК Код,
		|	ТНВЭДПоВидамПродукцииИС.ВидПродукции КАК ВидПродукции
		|ИЗ
		|	Справочник.ТНВЭДПоВидамПродукцииИС КАК ТНВЭДПоВидамПродукцииИС";

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ИмяТаблицы",    ИмяТаблицы);
			СтруктураПоиска.Вставить("Код",           ВыборкаДетальныеЗаписи.Код);
			СтруктураПоиска.Вставить("Идентификатор", ВыборкаДетальныеЗаписи.Идентификатор);
			
			СоставКлюча = Новый СписокЗначений;
			СоставКлюча.Добавить(ВыборкаДетальныеЗаписи.Код);
			СоставКлюча.Добавить(ВыборкаДетальныеЗаписи.ВидПродукции);
			СоставКлюча.СортироватьПоЗначению();
			
			КлючЗначения = ОбщегоНазначенияИС.ХэшСуммаСтроки(СтрСоединить(
				СоставКлюча.ВыгрузитьЗначения()));
				
			СтруктураПоиска.Вставить("КлючЗначения", КлючЗначения);
			
			НайденныеСтроки = Идентификаторы.НайтиСтроки(СтруктураПоиска);
			
			Если Не НайденныеСтроки.Количество() Тогда
				СтрокаИдентификатора = Идентификаторы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаИдентификатора, СтруктураПоиска);
				
				СтрокаИдентификатора.Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИнициализироватьПараметрыОбновления() Экспорт

    СтруктураДанныхОбновления = Новый Структура;

	СтруктураДанныхОбновления.Вставить("Наименование",               "");
	СтруктураДанныхОбновления.Вставить("НаименованиеПолное",         "");
	СтруктураДанныхОбновления.Вставить("Идентификатор",              "");
	СтруктураДанныхОбновления.Вставить("Статус",                     "");
	СтруктураДанныхОбновления.Вставить("ХешСуммаПоставляемыхДанных", "");
	СтруктураДанныхОбновления.Вставить("Код",                        "");
	СтруктураДанныхОбновления.Вставить("ВидПродукцииНаименование",   "");
	СтруктураДанныхОбновления.Вставить("ВидПродукцииИдентификатор",  "");
	СтруктураДанныхОбновления.Вставить("КодЧЗ",                      "");	

	Возврат СтруктураДанныхОбновления;
	
КонецФункции

#КонецОбласти

#КонецЕсли
